<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"1b50c655adb7ac47fe4bc1e001e289c2a0289f69483c925f3499ebcd514a0aa2","plan_job_ref":"Job Plan Airflow DAGs #457 at https://github.com/cal-itp/data-infra/actions/runs/16890637512","plan_out_hash":"1115d07ede853785d04b40e0ef43e3f74e7b97323ec259a55500d9492cedd3a2","plan_hash":"bbb1d1350f7efa161394bb26be8a8102fdc1740db9a5789d400013ce4e5a0d48","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/dbt_daily_dag.py"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/dbt_daily_dag.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/dbt_daily_dag.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "QcFFOQ==" -> (known after apply)
!~      detect_md5hash      = "khY7a1ajhB05E0j+Tc2btQ==" -> "different hash"
!~      generation          = 1754938422500316 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "khY7a1ajhB05E0j+Tc2btQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "S2qpTA==" -> (known after apply)
!~      detect_md5hash      = "85XKw3XMRCUO0mI66PDWGg==" -> "different hash"
!~      generation          = 1754938424114160 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "85XKw3XMRCUO0mI66PDWGg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #457](https://github.com/cal-itp/data-infra/actions/runs/16890637512)